//----------------------------eq()--------------------------------//
// метод eq(n) - возвращает элемент, идущий под индексом 'n' в наборе выбранных элементов

// $(function () {
//   $('div').not(3).addClass("blue");
//
//   $("div:eq(3)").css("background-color", "#4dea4d");
// });


//----------------------------Not()--------------------------------//
// $(function () {
//   $('li').not(':eq(2)').css('color', 'red');
// });

//----------------------------Is()--------------------------------//

$(function () {
  $("div").on('click', function () {
    if($(this).is(":first-child")) {
      $('p').text("гэта первый div");
    }
    else if ($(this).is(".blue, .red")) {
      $('p').text("гэта красный или синий div");
    }
    else if ($(this).is(":contains('Test')")) {
      $('p').text("содержит текст Test");
    }
    else {
      $('p').text("нэма нехуя");
    }
  })
});





























